
// 398 / 5 000
// Шаг 4. JavaScript имеет семь примитивных типов данных, одним из которых является String. В JavaScript строка представляет собой последовательность символов и может быть заключена в одинарные (') или двойные (") кавычки. Обратите внимание, что строки являются неизменяемыми, что означает, что после создания они не могут быть изменены. Переменной по-прежнему можно присвоить другое значение. Измените строку "Hello", чтобы использовать одинарные кавычки.

// let character = 'Hello';

// Консоль позволяет вам печатать и просматривать вывод JavaScript. Вы можете отправлять информацию на консоль с помощью console.log(). Например, этот код выведет на консоль "Naomi": Пример кода let developer = "Naomi"; console.log(developer); Приведенный выше код обращается к переменной developer по ее имени в console.log(). Обратите внимание, что значение в скобках — это значение, которое будет выведено. Выведите значение символьной переменной на консоль. Затем нажмите кнопку "Console", чтобы просмотреть консоль JavaScript.

// let character = 'Hello';
// console.log(character)